Revit 2026 API

# FluidTemperatureSetIteratorGetCurrent Method

---

Returns the current FluidTemperature.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FluidTemperature GetCurrent()
```
```vb
Public Function GetCurrent As FluidTemperature
```
```cpp
public:
FluidTemperature^ GetCurrent()
```
```fsharp
member GetCurrent : unit -> FluidTemperature
```

#### Return Value

FluidTemperature The current FluidTemperature.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

#### Reference

FluidTemperatureSetIterator Class

Autodesk.Revit.DB.Plumbing Namespace